org/redes/3.org
#+title: SMTP y DNS

* TODO Electronic Mail in the Internet

  e-mail is an asynchronous communication medium-people send and read messages
  when it is convenient for them, without having to coordinate with other
  people’s schedules.

  imagen 2.14

  We see from this diagram that it has three major components:
  - ~user agents~,
  - ~mail servers~, and
  - ~Simple Mail Transfer Protocol (SMTP)~

  Alice, sending an e-mail message to a recipient, Bob.

  User agents allow users to :
  - read,
  - reply to,
  - forward,
  - save, and
  - compose
  messages.

  When Alice is finished composing her message, her user agent sends the message
  to her mail server, where the message is placed in the mail server’s outgoing
  message queue. When Bob wants to read a message, his user agent retrieves the
  message from his mailbox in his mail server.

  Mail servers form the core of the e-mail infrastructure. Each recipient, has a
  ~mailbox~ located in one of the mail servers. A mailbox manages and maintains
  the messages that have been sent to him.

  A typical message starts its journey in
  - the sender’s user agent,
  - travels to the sender’s mail server, and
  - travels to the recipient’s mail server, and is deposited in the recipient’s
    mailbox.
  - When Bob wants to access the messages in his mailbox, the mail server
    containing his mailbox authenticates Bob (with usernames and passwords).

  Alice’s mail server must also deal with failures in Bob’s mail server. If
  Alice’s server cannot deliver mail to Bob’s server, Alice’s server holds the
  message in a ~message queue~ and attempts to transfer the message later.
  Reattempts are often done every 30 minutes or so; if there is no success after
  several days, the server removes the message and notifies the sender (Alice)
  with an e-mail message.

  SMTP is the principal application-layer protocol for Internet electronic
  mail. It uses the reliable data transfer service of TCP to transfer mail from
  the sender’s mail server to the recipient’s mail server. As with most
  application-layer protocols, SMTP has two sides:
  - a client side, which executes on the sender’s mail server, and
  - a server side, which executes on the recipient’s mail server.

  *Both* the client and server sides of SMTP run on every mail server. When a
  mail server sends mail to other mail servers, it acts as an SMTP client. When
  a mail server receives mail from other mail servers, it acts as an SMTP
  server.

