redes/3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 12:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SMTP y DNS</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="../res/org.css"/>
</head>
<body>
<div id="content">

<div id="outline-container-org2f5efbd" class="outline-2">
<h2 id="org2f5efbd"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Electronic Mail in the Internet</h2>
<div class="outline-text-2" id="text-1">
<p>
e-mail is an asynchronous communication medium-people send and read messages
when it is convenient for them, without having to coordinate with other
people’s schedules.
</p>

<p>
imagen 2.14
</p>

<p>
We see from this diagram that it has three major components:
</p>
<ul class="org-ul">
<li><code>user agents</code>,</li>
<li><code>mail servers</code>, and</li>
<li><code>Simple Mail Transfer Protocol (SMTP)</code></li>
</ul>

<p>
Alice, sending an e-mail message to a recipient, Bob.
</p>

<p>
User agents allow users to :
</p>
<ul class="org-ul">
<li>read,</li>
<li>reply to,</li>
<li>forward,</li>
<li>save, and</li>
<li>compose</li>
</ul>
<p>
messages.
</p>

<p>
When Alice is finished composing her message, her user agent sends the message
to her mail server, where the message is placed in the mail server’s outgoing
message queue. When Bob wants to read a message, his user agent retrieves the
message from his mailbox in his mail server.
</p>

<p>
Mail servers form the core of the e-mail infrastructure. Each recipient, has a
<code>mailbox</code> located in one of the mail servers. A mailbox manages and maintains
the messages that have been sent to him.
</p>

<p>
A typical message starts its journey in
</p>
<ul class="org-ul">
<li>the sender’s user agent,</li>
<li>travels to the sender’s mail server, and</li>
<li>travels to the recipient’s mail server, and is deposited in the recipient’s
mailbox.</li>
<li>When Bob wants to access the messages in his mailbox, the mail server
containing his mailbox authenticates Bob (with usernames and passwords).</li>
</ul>

<p>
Alice’s mail server must also deal with failures in Bob’s mail server. If
Alice’s server cannot deliver mail to Bob’s server, Alice’s server holds the
message in a <code>message queue</code> and attempts to transfer the message later.
Reattempts are often done every 30 minutes or so; if there is no success after
several days, the server removes the message and notifies the sender (Alice)
with an e-mail message.
</p>

<p>
SMTP is the principal application-layer protocol for Internet electronic
mail. It uses the reliable data transfer service of TCP to transfer mail from
the sender’s mail server to the recipient’s mail server. As with most
application-layer protocols, SMTP has two sides:
</p>
<ul class="org-ul">
<li>a client side, which executes on the sender’s mail server, and</li>
<li>a server side, which executes on the recipient’s mail server.</li>
</ul>

<p>
<b>Both</b> the client and server sides of SMTP run on every mail server. When a
mail server sends mail to other mail servers, it acts as an SMTP client. When
a mail server receives mail from other mail servers, it acts as an SMTP
server.
</p>
</div>
