org/redes/3.org
** SMTP
   RFC 5321

   restricts +the body (not just the headers) of+ all mail messages to simple
   7-bit ASCII. This restriction made sense in the early 1980s when transmission
   capacity was scarce and no one was e mailing large attachments or large
   image, audio, or video files. But today, in the multimedia era, the 7-bit
   ASCII restriction is a bit of a pain -it requires binary multimedia data to
   be encoded to ASCII before being sent over SMTP; and it requires the
   corresponding ASCII message to be decoded back to binary after SMTP
   transport.

   Suppose Alice wants to send Bob a simple ASCII message.
   1. Alice invokes her user agent for e-mail, provides Bob’s e-mail address
      (for example, bob@someschool.edu ), composes a message, and instructs the
      user agent to send the message.
   2. Alice’s user agent sends the message to her mail server, where it is
      placed in a message queue.
   3. The client side of SMTP, running on Alice’s mail server, sees the message
      in the message queue. It opens a TCP connection to an SMTP server, running
      on Bob’s mail server.
   4. After some initial SMTP handshaking, the SMTP client sends Alice’s message
      into the TCP connection.
   5. At Bob’s mail server, the server side of SMTP receives the message. Bob’s
      mail server then places the message in Bob’s mailbox.
   6. Bob invokes his user agent to read the message at his convenience.

   imagen 2.15

   It is important to observe that SMTP does not normally use intermediate mail
   servers for sending mail, even when the two mail servers are located at
   opposite ends of the world. If Alice’s server is in Hong Kong and Bob’s
   server is in St. Louis, the TCP connection is a direct connection between the
   Hong Kong and St. Louis servers. In particular, if Bob’s mail server is down,
   the message remains in Alice’s mail server and waits for a new attempt-the
   message does not get placed in some intermediate mail server.

   Let’s now take a closer look at how SMTP transfers a message from a sending
   mail server to a receiving mail server.
   - First, the client SMTP (running on the sending mail server host) has TCP
     establish a connection to port 25 at the server SMTP (running on the
     receiving mail server host).
     - If the server is down, the client tries again later.
   - Once this connection is established, the server and client perform some
     application-layer handshaking.
     - During this SMTP handshaking phase, the SMTP client indicates the e-mail
       address of the sender (the person who generated the message) and the
       e-mail address of the recipient.
   - Once the SMTP client and server have introduced themselves to each other,
     the client sends the message.

   SMTP can count on the reliable data transfer service of TCP to get the
   message to the server without errors. The client then repeats this process
   over the same TCP connection if it has other messages to send to the server;
   otherwise, it instructs TCP to close the connection.

   exchanged messages between Client (C) with hostname ~crepes.fr~ and Server
   (S) with hostname ~hamburger.edu~.

   #+begin_quote
   S:  220 hamburger.edu
   C:  HELO crepes.fr
   S:  250 Hello crepes.fr, pleased to meet you
   C:  MAIL FROM: <alice@crepes.fr>
   S:  250 alice@crepes.fr ... Sender ok
   C:  RCPT TO: <bob@hamburger.edu>
   S:  250 bob@hamburger.edu ... Recipient ok
   C:  DATA
   S:  354 Enter mail, end with ”.” on a line by itself
   C:  Do you like ketchup?
   C:  How about pickles?
   C:  .
   S:  250 Message accepted for delivery
   C:  QUIT
   S:  221 hamburger.edu closing connection
   #+end_quote

   | server                                           | client                       |
   |--------------------------------------------------+------------------------------|
   | 220 hamburger.edu                                |                              |
   |                                                  | HELO crepes.fr               |
   | 250 Hello crepes.fr, pleased to meet you         |                              |
   |                                                  | MAIL FROM: <alice@crepes.fr> |
   | 250 alice@crepes.fr ... Sender ok                |                              |
   |                                                  | RCPT TO: <bob@hamburger.edu> |
   | 250 bob@hamburger.edu ... Recipient ok           |                              |
   |                                                  | DATA                         |
   | 354 Enter mail, end with ”.” on a line by itself |                              |
   |                                                  | Do you like ketchup?         |
   |                                                  | How about pickles?           |
   |                                                  | .                            |
   | 250 Message accepted for delivery                |                              |
   |                                                  | QUIT                         |
   | 221 hamburger.edu closing connection             |                              |

   the client issued five commands: HELO (an abbreviation for HELLO), MAIL FROM,
   RCPT TO, DATA, and QUIT .

   The client also sends a line consisting of a single period, which indicates
   the end of the message to the server. (In ASCII jargon, each message ends
   with CRLF.CRLF , where CR and LF stand for carriage return and line feed,
   respectively.) The server issues replies to each command, with each reply
   having a reply code and some (optional) explanation.

   As SMTP uses persistent connections: If the sending mail server has several
   messages to send to the same receiving mail server, it can send all of the
   messages over the same TCP connection. For each message, the client begins
   the process with a new MAIL FROM: crepes.fr , designates the end of message
   with an isolated period, and issues QUIT only after all messages have been
   sent.

