redes/3.html

<div id="outline-container-org8638e87" class="outline-3">
<h3 id="org8638e87"><span class="section-number-3">1.1</span> SMTP</h3>
<div class="outline-text-3" id="text-1-1">
<p>
RFC 5321
</p>

<p>
restricts <del>the body (not just the headers) of</del> all mail messages to simple
7-bit ASCII. This restriction made sense in the early 1980s when transmission
capacity was scarce and no one was e mailing large attachments or large
image, audio, or video files. But today, in the multimedia era, the 7-bit
ASCII restriction is a bit of a pain -it requires binary multimedia data to
be encoded to ASCII before being sent over SMTP; and it requires the
corresponding ASCII message to be decoded back to binary after SMTP
transport.
</p>

<p>
Suppose Alice wants to send Bob a simple ASCII message.
</p>
<ol class="org-ol">
<li>Alice invokes her user agent for e-mail, provides Bob’s e-mail address
(for example, bob@someschool.edu ), composes a message, and instructs the
user agent to send the message.</li>
<li>Alice’s user agent sends the message to her mail server, where it is
placed in a message queue.</li>
<li>The client side of SMTP, running on Alice’s mail server, sees the message
in the message queue. It opens a TCP connection to an SMTP server, running
on Bob’s mail server.</li>
<li>After some initial SMTP handshaking, the SMTP client sends Alice’s message
into the TCP connection.</li>
<li>At Bob’s mail server, the server side of SMTP receives the message. Bob’s
mail server then places the message in Bob’s mailbox.</li>
<li>Bob invokes his user agent to read the message at his convenience.</li>
</ol>

<p>
imagen 2.15
</p>

<p>
It is important to observe that SMTP does not normally use intermediate mail
servers for sending mail, even when the two mail servers are located at
opposite ends of the world. If Alice’s server is in Hong Kong and Bob’s
server is in St. Louis, the TCP connection is a direct connection between the
Hong Kong and St. Louis servers. In particular, if Bob’s mail server is down,
the message remains in Alice’s mail server and waits for a new attempt-the
message does not get placed in some intermediate mail server.
</p>

<p>
Let’s now take a closer look at how SMTP transfers a message from a sending
mail server to a receiving mail server.
</p>
<ul class="org-ul">
<li>First, the client SMTP (running on the sending mail server host) has TCP
establish a connection to port 25 at the server SMTP (running on the
receiving mail server host).
<ul class="org-ul">
<li>If the server is down, the client tries again later.</li>
</ul></li>
<li>Once this connection is established, the server and client perform some
application-layer handshaking.
<ul class="org-ul">
<li>During this SMTP handshaking phase, the SMTP client indicates the e-mail
address of the sender (the person who generated the message) and the
e-mail address of the recipient.</li>
</ul></li>
<li>Once the SMTP client and server have introduced themselves to each other,
the client sends the message.</li>
</ul>

<p>
SMTP can count on the reliable data transfer service of TCP to get the
message to the server without errors. The client then repeats this process
over the same TCP connection if it has other messages to send to the server;
otherwise, it instructs TCP to close the connection.
</p>

<p>
exchanged messages between Client (C) with hostname <code>crepes.fr</code> and Server
(S) with hostname <code>hamburger.edu</code>.
</p>

<blockquote>
<p>
S:  220 hamburger.edu
C:  HELO crepes.fr
S:  250 Hello crepes.fr, pleased to meet you
C:  MAIL FROM: &lt;alice@crepes.fr&gt;
S:  250 alice@crepes.fr &#x2026; Sender ok
C:  RCPT TO: &lt;bob@hamburger.edu&gt;
S:  250 bob@hamburger.edu &#x2026; Recipient ok
C:  DATA
S:  354 Enter mail, end with ”.” on a line by itself
C:  Do you like ketchup?
C:  How about pickles?
C:  .
S:  250 Message accepted for delivery
C:  QUIT
S:  221 hamburger.edu closing connection
</p>
</blockquote>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">server</th>
<th scope="col" class="org-left">client</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">220 hamburger.edu</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">HELO crepes.fr</td>
</tr>

<tr>
<td class="org-left">250 Hello crepes.fr, pleased to meet you</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">MAIL FROM: &lt;alice@crepes.fr&gt;</td>
</tr>

<tr>
<td class="org-left">250 alice@crepes.fr &#x2026; Sender ok</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">RCPT TO: &lt;bob@hamburger.edu&gt;</td>
</tr>

<tr>
<td class="org-left">250 bob@hamburger.edu &#x2026; Recipient ok</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DATA</td>
</tr>

<tr>
<td class="org-left">354 Enter mail, end with ”.” on a line by itself</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Do you like ketchup?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">How about pickles?</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">.</td>
</tr>

<tr>
<td class="org-left">250 Message accepted for delivery</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">QUIT</td>
</tr>

<tr>
<td class="org-left">221 hamburger.edu closing connection</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
the client issued five commands: HELO (an abbreviation for HELLO), MAIL FROM,
RCPT TO, DATA, and QUIT .
</p>

<p>
The client also sends a line consisting of a single period, which indicates
the end of the message to the server. (In ASCII jargon, each message ends
with CRLF.CRLF , where CR and LF stand for carriage return and line feed,
respectively.) The server issues replies to each command, with each reply
having a reply code and some (optional) explanation.
</p>

<p>
As SMTP uses persistent connections: If the sending mail server has several
messages to send to the same receiving mail server, it can send all of the
messages over the same TCP connection. For each message, the client begins
the process with a new MAIL FROM: crepes.fr , designates the end of message
with an isolated period, and issues QUIT only after all messages have been
sent.
</p>
</div>
</div>
