redes/3.html

<div id="outline-container-org163a0fc" class="outline-3">
<h3 id="org163a0fc"><span class="section-number-3">1.2</span> Comparison with HTTP</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Both protocols are used to transfer files from one host to another: HTTP
transfers files (also called objects) from a Web server to a Web client
(typically a browser); SMTP transfers files (that is, e-mail messages) from
one mail server to another mail server.  When transferring the files, both
persistent HTTP and SMTP use <code>persistent connections</code>.
</p>

<p>
However, there are important differences.
</p>

<ul class="org-ul">
<li>First, HTTP is mainly a <code>pull protocol</code> - someone loads information on a
Web server and users use HTTP to pull the information from the server at
their convenience. In particular, the TCP connection is initiated by the
machine that wants to receive the file. On the other hand, SMTP is
primarily a <code>push protocol</code> — the sending mail server pushes the file to
the receiving mail server. In particular, the TCP connection is initiated
by the machine that wants to send the file.</li>
<li>A second difference, which we alluded to earlier, is that SMTP requires
each message, including the body of each message, to be in 7-bit ASCII
format. If the message contains characters that are not 7-bit ASCII (for
example, French characters with accents) or contains binary data (such as
an image file), then the message has to be encoded into 7-bit ASCII. HTTP
data does not impose this restriction.</li>
<li>A third important difference concerns how a document consisting of text and
images (along with possibly other media types) is handled. HTTP
encapsulates each object in its own HTTP response message. SMTP places all
of the message’s objects into one message.</li>
</ul>
</div>
</div>

<div id="outline-container-org99065b5" class="outline-3">
<h3 id="org99065b5"><span class="section-number-3">1.3</span> Mail Message Formats</h3>
<div class="outline-text-3" id="text-1-3">
<p>
when an e-mail message is sent from one person to another, a header
containing peripheral information (such as receiver address, return address
and date in ordinary snail-mail letters) precedes the body of the message
itself. This peripheral information is contained in a series of header lines,
which are defined in RFC 5322.
</p>

<p>
RFC 5322 specifies the exact format for mail header lines as well as their
semantic interpretations. As with HTTP, each header line contains readable
text, consisting of a keyword followed by a colon followed by a value.
</p>

<p>
Every header must have a <code>From:</code> header line and a <code>To:</code> header line; a
header may include a <code>Subject:</code> header line as well as other optional header
lines. It is important to note that <b>these header lines are different from
the SMTP commands we studied before</b>. The commands in that section were part
of the <code>SMTP handshaking protocol</code>; the header lines examined in this section
are part of the mail message itself.
</p>

<p>
A typical message header looks like this:
</p>

<pre class="example">
From: alice@crepes.fr
To: bob@hamburger.edu
Subject: Searching for the meaning of life.
</pre>

<p>
After the message header, a blank line follows (CLRF); then the message body
(in ASCII) follows.
</p>


<p>
del articulo sobre smtp en wikipedia
</p>
<blockquote>
<p>
SMTP defines message transport, not the message content. Thus, it defines the
mail envelope and its parameters, such as the envelope sender, but not the
header (except trace information) nor the body of the message itself. STD 10
and RFC 5321 define SMTP (the envelope), while STD 11 and RFC 5322 define the
message (header and body), formally referred to as the Internet Message
Format.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org690e06f" class="outline-3">
<h3 id="org690e06f"><span class="section-number-3">1.4</span> Mail Access Protocols</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Once SMTP delivers the message from Alice’s mail server to Bob’s mail server,
the message is placed in Bob’s mailbox.
</p>

<p>
today, mail access uses a client-server architecture—the typical <b>user reads
e-mail with a client that executes on the user’s end system</b>.
</p>

<p>
Given that the recipient executes his user agent on his local PC, it is
natural to consider placing a mail server on his local PC as well. With this
approach, the sender's mail server would dialogue directly with the
receiver’s PC.
</p>

<p>
However, There is a problem with this approach. Recall that a mail server
manages mailboxes and runs the client and server sides of SMTP. If the
recipient's mail server were to reside on his local PC, then it would have to
remain always on, and connected to the Internet, in order to receive new
mail, which can arrive at any time.
</p>

<p>
This is impractical for many Internet users. Instead, a typical user runs a
user agent on the local PC but accesses its mailbox stored on an <code>always-on</code>
<code>shared</code> mail server typically maintained by the user’s ISP.
</p>

<p>
Now let’s consider the path an e-mail message takes when it is sent from
Alice to Bob. We just learned that at some point along the path the e-mail
message needs to be deposited in Bob’s mail server. This could be done simply
by having Alice’s user agent send the message directly to Bob’s mail
server. And this could be done with SMTP—indeed, SMTP has been designed for
pushing e-mail from one host to another. However, typically the sender’s user
agent does not dialogue directly with the recipient’s mail server. Instead,
as shown in Figure 2.16, Alice’s user agent uses SMTP to push the e-mail
message into her mail server, then Alice’s mail server uses SMTP (as an SMTP
client) to relay the e-mail message to Bob’s mail server. Why the two-step
procedure? Primarily because without relaying through Alice’s mail server,
Alice’s user agent doesn’t have any recourse to an unreachable destination
mail server. By having Alice first deposit the e-mail in her own mail server,
Alice’s mail server can repeatedly try to send the message to Bob’s mail
server, say every 30 minutes, until Bob’s mail server becomes operational.
</p>

<p>
imagen 2.16
</p>

<p>
<b>How does a recipient like Bob, running a user agent on his local PC, obtain
his messages, which are sitting in a mail server within Bob’s ISP?</b> Note that
Bob’s user agent can’t use SMTP to obtain the messages because obtaining the
messages is a pull operation, whereas SMTP is a push protocol. special mail
access protocol that transfers messages from Bob’s mail server to his local
PC. There are currently a number of popular mail access protocols, including
<code>Post Office Protocol—Version 3 (POP3)</code>, <code>Internet Mail Access Protocol
   (IMAP)</code>, and <code>HTTP</code>.
</p>
</div>
