org/redes/3.org
*** POP3
    [RFC 1939]

    arquitectura cliente servidor, donde el user-agent es el cliente.

    POP3 comienza cuando el user-agent abre una conexion tcp con el mail
    server en el puerto 110.

    luego de establecer la conexion, pop3 inicia 3 fases:
    1. autorizacion: el user-agent envia un nombre de usuario y contraseña para
       autenticar al usuario. Comandos:  ~user <username>~, ~pass <password>~

    2. Transaccion: el user-agent retira los mensajes; tambien puede
       marcar/desmarcar mensajes para eliminarlos y obtener estadisticas del
       mail. Comandos: ~list~, ~retr~, ~dele~, ~quit~. El user-agent puede ser
       configurado para:
       + =Download and delete=
         #+caption: interaccion entre cliente(C) y servidor (S)
         #+BEGIN_SRC
         C: list
         S: 1 498
         S: 2 912
         S: .
         C: retr 1
         S: (blah blah ...
         S: .................
         S: ..........blah)
         S: .
         C: dele 1
         C: retr 2
         S: (blah blah ...
         S: .................
         S: ..........blah)
         S: .
         C: dele 2
         C: quit
         S: +OK POP3 server signing off
         #+END_SRC

         | Servidor                    | Cliente |
         |                             | list    |
         | 1 498                       |         |
         | 2 912                       |         |
         | .                           |         |
         |                             | retr 1  |
         | (blah blah ...              |         |
         | .................           |         |
         | ..........blah)             |         |
         | .                           |         |
         |                             | dele 1  |
         |                             | retr 2  |
         | (blah blah ...              |         |
         | .................           |         |
         | ..........blah)             |         |
         | .                           |         |
         |                             | dele 2  |
         |                             | quit    |
         | +OK POP3 server signing off |         |

         A problem with this download-and-delete mode the recipient may want to
         access his mail messages from multiple machines. The mode partitions the
         user’s mail messages over the machines; in particular, if the user first
         reads a message on his office PC, he will not be able to reread the
         message from his portable at home later in the evening. In the
         download-and-keep mode, the user agent leaves the messages on the mail
         server after downloading them. In this case, the user can reread
         messages from different machines;

       + =Download and keep=

    3. =Update=: ocurre luego de que el cliente ejecuta el comando ~quit~,
       finalizando la sesion POP3. en este momento, el mail server elimina los
       mensajes que fueron marcados para borrarse.

    El servidor responde a cada comando con una respuesta:
    - ~+OK~, para indicar que el comando fue exitoso
    - ~-ERR~, para indicar que hubo un error

    Durante la sesion, el server mantiene el estado de la sesion. lleva registro
    de los mensajes marcados para su eliminacion, etc. sin embargo no se
    mantiene un estado entre sesiones.

*** IMAP
    [RFC 3501]

    IMAP fue creado para proveer al usuario de herramientas para crear carpetas
    remotas y asignar mensajes a dichas carpetas, lo que pop3 no puede hacer.

    en imap, e- servidor asocia cada mensaje con una carpeta. por defecto se
    asocia a INBOX.

    The IMAP protocol provides commands to allow users to create folders and
    move messages from one folder to another.

    IMAP also provides commands that allow users to search remote folders for
    messages matching specific criteria.

    Note that, unlike POP3, an IMAP server maintains user state information
    across IMAP sessions—for example, the names of the folders and which
    messages are associated with which folders.

    Another important feature of IMAP is that it has commands that *permit a
    user agent to obtain components of messages*. For example, a user agent can
    obtain just the message header of a message or just one part of a multipart
    MIME message. This feature is useful when there is a low-bandwidth
    connection (for example, a slow-speed modem link) between the user agent and
    its mail server. With a low-bandwidth connection, the user may not want to
    download all of the messages in its mailbox, particularly avoiding long
    messages that might contain, for example, an audio or video clip.

*** Web-based E-Mail
    More and more users today are sending and accessing their e-mail through
    their Web browsers.

    Hotmail introduced Web-based access in the mid 1990s.

    With this service, *the user agent is an ordinary Web browser*, and the user
    communicates with its remote mailbox via HTTP. When a recipient, such as
    Bob, wants to access a message in his mailbox, the e-mail message is sent
    from Bob’s mail server to Bob’s browser using the HTTP protocol rather than
    the POP3 or IMAP protocol.  When a sender, such as Alice, wants to send an
    e-mail message, the e-mail message is sent from her browser to her mail
    server over HTTP rather than over SMTP. Alice’s mail server, however, still
    sends messages to, and receives messages from, other mail servers using
    SMTP.

* TODO DNS - The Internet's Directory Service

  [RFC 1034] [RFC 1035] +

  Internet hosts can be identified in many ways. One identifier for a host is
  its ~hostname~ . Hostnames — such as www.facebook.com, www.google.com ,
  gaia.cs.umass.edu —are mnemonic and are therefore appreciated by humans.

  However, hostnames provide little, if any, information about the location
  within the Internet of the host. (A hostname such as www.eurecom.fr , which
  ends with the country code .fr , tells us that the host is probably in France,
  but doesn’t say much more.) Furthermore, because hostnames can consist of
  variable-length alphanumeric characters, they would be difficult to process by
  routers. For these reasons, hosts are also identified by so-called ~IP
  addresses~.

  An IP address consists of four bytes and has a rigid hierarchical structure.
  the bytes expressed in decimal notation from 0 to 255. An IP address is
  hierarchical because as we scan the address from left to right, we obtain more
  and more specific information about where the host is located in the Internet
  (that is, within which network, in the network of networks).

