redes/3.html

<div id="outline-container-org5a1c408" class="outline-4">
<h4 id="org5a1c408"><span class="section-number-4">1.4.1</span> POP3</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
[RFC 1939]
</p>

<p>
arquitectura cliente servidor, donde el user-agent es el cliente.
</p>

<p>
POP3 comienza cuando el user-agent abre una conexion tcp con el mail
server en el puerto 110.
</p>

<p>
luego de establecer la conexion, pop3 inicia 3 fases:
</p>
<ol class="org-ol">
<li>autorizacion: el user-agent envia un nombre de usuario y contraseña para
autenticar al usuario. Comandos:  <code>user &lt;username&gt;</code>, <code>pass &lt;password&gt;</code></li>

<li>Transaccion: el user-agent retira los mensajes; tambien puede
marcar/desmarcar mensajes para eliminarlos y obtener estadisticas del
mail. Comandos: <code>list</code>, <code>retr</code>, <code>dele</code>, <code>quit</code>. El user-agent puede ser
configurado para:
<ul class="org-ul">
<li><p>
<code>Download and delete</code>
</p>
<pre class="example">
C: list
S: 1 498
S: 2 912
S: .
C: retr 1
S: (blah blah ...
S: .................
S: ..........blah)
S: .
C: dele 1
C: retr 2
S: (blah blah ...
S: .................
S: ..........blah)
S: .
C: dele 2
C: quit
S: +OK POP3 server signing off
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Servidor</td>
<td class="org-left">Cliente</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">list</td>
</tr>

<tr>
<td class="org-left">1 498</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2 912</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">retr 1</td>
</tr>

<tr>
<td class="org-left">(blah blah &#x2026;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;..</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#x2026;&#x2026;&#x2026;.blah)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">dele 1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">retr 2</td>
</tr>

<tr>
<td class="org-left">(blah blah &#x2026;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;..</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#x2026;&#x2026;&#x2026;.blah)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">dele 2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">quit</td>
</tr>

<tr>
<td class="org-left">+OK POP3 server signing off</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
A problem with this download-and-delete mode the recipient may want to
access his mail messages from multiple machines. The mode partitions the
user’s mail messages over the machines; in particular, if the user first
reads a message on his office PC, he will not be able to reread the
message from his portable at home later in the evening. In the
download-and-keep mode, the user agent leaves the messages on the mail
server after downloading them. In this case, the user can reread
messages from different machines;
</p></li>

<li><code>Download and keep</code></li>
</ul></li>

<li><code>Update</code>: ocurre luego de que el cliente ejecuta el comando <code>quit</code>,
finalizando la sesion POP3. en este momento, el mail server elimina los
mensajes que fueron marcados para borrarse.</li>
</ol>

<p>
El servidor responde a cada comando con una respuesta:
</p>
<ul class="org-ul">
<li><code>+OK</code>, para indicar que el comando fue exitoso</li>
<li><code>-ERR</code>, para indicar que hubo un error</li>
</ul>

<p>
Durante la sesion, el server mantiene el estado de la sesion. lleva registro
de los mensajes marcados para su eliminacion, etc. sin embargo no se
mantiene un estado entre sesiones.
</p>
</div>
</div>

<div id="outline-container-org01cb20a" class="outline-4">
<h4 id="org01cb20a"><span class="section-number-4">1.4.2</span> IMAP</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
[RFC 3501]
</p>

<p>
IMAP fue creado para proveer al usuario de herramientas para crear carpetas
remotas y asignar mensajes a dichas carpetas, lo que pop3 no puede hacer.
</p>

<p>
en imap, e- servidor asocia cada mensaje con una carpeta. por defecto se
asocia a INBOX.
</p>

<p>
The IMAP protocol provides commands to allow users to create folders and
move messages from one folder to another.
</p>

<p>
IMAP also provides commands that allow users to search remote folders for
messages matching specific criteria.
</p>

<p>
Note that, unlike POP3, an IMAP server maintains user state information
across IMAP sessions—for example, the names of the folders and which
messages are associated with which folders.
</p>

<p>
Another important feature of IMAP is that it has commands that <b>permit a
user agent to obtain components of messages</b>. For example, a user agent can
obtain just the message header of a message or just one part of a multipart
MIME message. This feature is useful when there is a low-bandwidth
connection (for example, a slow-speed modem link) between the user agent and
its mail server. With a low-bandwidth connection, the user may not want to
download all of the messages in its mailbox, particularly avoiding long
messages that might contain, for example, an audio or video clip.
</p>
</div>
</div>

<div id="outline-container-org7602f3b" class="outline-4">
<h4 id="org7602f3b"><span class="section-number-4">1.4.3</span> Web-based E-Mail</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
More and more users today are sending and accessing their e-mail through
their Web browsers.
</p>

<p>
Hotmail introduced Web-based access in the mid 1990s.
</p>

<p>
With this service, <b>the user agent is an ordinary Web browser</b>, and the user
communicates with its remote mailbox via HTTP. When a recipient, such as
Bob, wants to access a message in his mailbox, the e-mail message is sent
from Bob’s mail server to Bob’s browser using the HTTP protocol rather than
the POP3 or IMAP protocol.  When a sender, such as Alice, wants to send an
e-mail message, the e-mail message is sent from her browser to her mail
server over HTTP rather than over SMTP. Alice’s mail server, however, still
sends messages to, and receives messages from, other mail servers using
SMTP.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4beb0db" class="outline-2">
<h2 id="org4beb0db"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> DNS - The Internet's Directory Service</h2>
<div class="outline-text-2" id="text-2">
<p>
[RFC 1034] [RFC 1035] +
</p>

<p>
Internet hosts can be identified in many ways. One identifier for a host is
its <code>hostname</code> . Hostnames — such as www.facebook.com, www.google.com ,
gaia.cs.umass.edu —are mnemonic and are therefore appreciated by humans.
</p>

<p>
However, hostnames provide little, if any, information about the location
within the Internet of the host. (A hostname such as www.eurecom.fr , which
ends with the country code .fr , tells us that the host is probably in France,
but doesn’t say much more.) Furthermore, because hostnames can consist of
variable-length alphanumeric characters, they would be difficult to process by
routers. For these reasons, hosts are also identified by so-called <code>IP
  addresses</code>.
</p>

<p>
An IP address consists of four bytes and has a rigid hierarchical structure.
the bytes expressed in decimal notation from 0 to 255. An IP address is
hierarchical because as we scan the address from left to right, we obtain more
and more specific information about where the host is located in the Internet
(that is, within which network, in the network of networks).
</p>
</div>
