redes/3.html

<div id="outline-container-org82f6bd2" class="outline-3">
<h3 id="org82f6bd2"><span class="section-number-3">2.1</span> Services provided by DNS</h3>
<div class="outline-text-3" id="text-2-1">
<p>
People prefer the more mnemonic hostname identifier, while routers prefer
fixed-length, hierarchically structured IP addresses. In order to reconcile
these preferences, we need a directory service that translates hostnames to
IP addresses. This is the main task of the Internet’s <code>domain name system
   (DNS)</code>. The DNS is
</p>
<ol class="org-ol">
<li>a distributed database implemented in a hierarchy of DNS servers, and</li>
<li>an application-layer protocol that allows hosts to query the distributed
database. The DNS servers are often UNIX machines running the Berkeley
Internet Name Domain (BIND) software [BIND 2016]. The DNS protocol runs
over UDP and uses port 53.</li>
</ol>

<p>
DNS is commonly employed by other application-layer protocols—including HTTP
and SMTP to translate user-supplied hostnames to IP addresses. As an example,
consider what happens when a browser (that is, an HTTP client), running on
some user’s host, requests the URL www.someschool.edu/index.html . In order
for the user’s host to be able to send an HTTP request message to the Web
server www.someschool.edu , the user’s host must first obtain the IP address
of www.someschool.edu . This is done as follows.
</p>
<ol class="org-ol">
<li>The same user machine runs the client side of the DNS application.</li>
<li>The browser extracts the hostname, www.someschool.edu , from the URL and
passes the hostname to the client side of the DNS application.</li>
<li>The DNS client sends a query containing the hostname to a DNS server.</li>
<li>The DNS client eventually receives a reply, which includes the IP address
for the hostname.</li>
<li>Once the browser receives the IP address from DNS, it can initiate a TCP
connection to the HTTP server process located at port 80 at that IP
address.</li>
</ol>

<p>
DNS provides a few other important services in addition to translating
hostnames to IP addresses:
</p>

<dl class="org-dl">
<dt>Host aliasing</dt><dd>A host with a complicated hostname can have one or more
alias names. For example, a hostname such as
relay1.west-coast.enterprise.com could have, say, two
aliases such as enterprise.com and www.enterprise.com . In
this case, the hostname relay1.west-coast.enterprise.com
is said to be a <code>canonical hostname</code>. <code>Alias hostnames</code>,
when present, are typically more mnemonic than canonical
hostnames. DNS can be invoked by an application to obtain
the canonical hostname for a supplied alias hostname as
well as the IP address of the host.</dd>
<dt>Mail server aliasing</dt><dd>For obvious reasons, it is highly desirable that
e-mail addresses be mnemonic. For example, if Bob has an account with
Yahoo Mail, Bob’s e-mail address might be as simple as
bob@yahoo.mail. However, the hostname of the Yahoo mail server is more
complicated and much less mnemonic than simply yahoo.com (for example,
the canonical hostname might be something like
relay1.west-coast.yahoo.com ). DNS can be invoked by a mail application
to obtain the canonical hostname for a supplied alias hostname as well
as the IP address of the host.  In fact, the MX record (see below)
permits a company’s mail server and Web server to have identical
(aliased) hostnames; for example, a company’s Web server and mail server
can both be called enterprise.com.
<dl class="org-dl">
<dt>Load distribution</dt><dd>DNS is also used to perform load distribution
among replicated servers, such as replicated Web servers. Busy
sites, such as cnn.com, are replicated over multiple servers, with
each server running on a different end system and each having a
different IP address. For replicated Web servers, a set of IP
addresses is thus associated with one canonical hostname. The DNS
database contains this set of IP addresses. When clients make a DNS
query for a name mapped to a set of addresses, the server responds
with the entire set of IP addresses, but rotates the ordering of
the addresses within each reply. Because a client typically sends
its HTTP request message to the IP address that is listed first in
the set, DNS rotation distributes the traffic among the replicated
servers. DNS rotation is also used for e-mail so that multiple mail
servers can have the same alias name. Also, content distribution
companies such as Akamai have used DNS in more sophisticated ways
to provide Web content distribution.</dd>
</dl></dd>
</dl>

<p>
PRINCIPLES IN PRACTICE
DNS: CRITICAL NETWORK FUNCTIONS VIA THE CLIENT-SERVER PARADIGM
</p>
<blockquote>
<p>
Like HTTP, FTP, and SMTP, the DNS protocol is an application-layer protocol
since it (1) runs between communicating end systems using the client-server
paradigm and (2) relies on an underlying end-to-end transport protocol to
transfer DNS messages between communicating end systems. In another sense,
however, the role of the DNS is quite different from Web, file transfer, and
e-mail applications. Unlike these applications, the DNS is not an application
with which a user directly interacts. Instead, the DNS provides a core
Internet function—namely, translating hostnames to their underlying IP
addresses, for user applications and other software in the Internet. We noted
that much of the complexity in the Internet architecture is located at the
“edges” of the network. The DNS, which implements the critical name-to-
address translation process using clients and servers located at the edge of
the network, is yet another example of that design philosophy.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org46eaa36" class="outline-3">
<h3 id="org46eaa36"><span class="section-number-3">2.2</span> Overview of How DNS Works</h3>
<div class="outline-text-3" id="text-2-2">
<p>
hostname-to-IP-address translation service.
</p>

<p>
Suppose that some application running in a user’s host needs to translate a
hostname to an IP address. The application will invoke the client side of
DNS, specifying the hostname that needs to be translated. DNS in the user’s
host then takes over, sending a query message into the network. All DNS query
and reply messages are sent within UDP datagrams to port 53. After a delay,
ranging from milliseconds to seconds, DNS in the user’s host receives a DNS
reply message that provides the desired mapping. This mapping is then passed
to the invoking application. Thus, from the perspective of the invoking
application in the user’s host, DNS is a black box providing a simple,
straightforward translation service. But in fact, the black box that
implements the service is complex, consisting of a large number of DNS
servers distributed around the globe, as well as an application-layer
protocol that specifies how the DNS servers and querying hosts communicate.
</p>

<p>
A simple design for DNS would have <b>one DNS server</b> that contains all the
mappings. Although the simplicity of this design is attractive, it is
inappropriate for today’s Internet, with its vast (and growing) number of
hosts. The problems with a centralized design include:
</p>
<dl class="org-dl">
<dt>A single point of failure</dt><dd>If the DNS server crashes, so does the entire
Internet!</dd>
<dt>Traffic volume</dt><dd>A single DNS server would have to handle all DNS queries
(for all the HTTP requests and e-mail messages generated
from hundreds of millions of hosts).</dd>
<dt>Distant centralized database</dt><dd>A single DNS server cannot be “close to”
all the querying clients. If we put the single DNS server in New York
City, then all queries from Australia must travel to the other side of
the globe, perhaps over slow and congested links. This can lead to
significant delays.</dd>
<dt>Maintenance</dt><dd>The single DNS server would have to keep records for all
Internet hosts. Not only would this centralized database be
huge, but it would have to be updated frequently to account
for every new host.</dd>
</dl>

<p>
a single DNS server simply doesn’t scale
</p>
</div>
