redes/3.html

<div id="outline-container-org1b85b71" class="outline-4">
<h4 id="org1b85b71"><span class="section-number-4">2.2.1</span> A Distributed, Hierarchical Database</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
In order to deal with the issue of scale, the DNS uses a large number of
servers, organized in a hierarchical fashion and distributed around the
world. No single DNS server has all of the mappings for all of the hosts in
the Internet. Instead, the mappings are distributed across the DNS
servers. To a first approximation, there are three classes of DNS servers—
<code>root</code> DNS servers, <code>top-level domain (TLD)</code> DNS servers, and
<code>authoritative</code> DNS servers.
</p>

<p>
imagen 2.17
</p>

<p>
suppose a DNS client wants to determine the IP address for the hostname
www.amazon.com.
</p>

<p>
The client first contacts one of the root servers, which returns IP
addresses for TLD servers for the top-level domain com . The client then
contacts one of these TLD servers, which returns the IP address of an
authoritative server for amazon.com . Finally, the client contacts one of
the authoritative servers for amazon.com , which returns the IP address for
the hostname www.amazon.com . We’ll soon examine this DNS lookup process in
more detail. But let’s first take a closer look at these three classes of
DNS servers:
</p>

<dl class="org-dl">
<dt>Root DNS servers</dt><dd>There are over 400 root name servers scattered all
over the world. These root name servers are managed by 13 different
organizations. Root name servers provide the IP addresses of the TLD
servers.</dd>
<dt>Top-level domain (TLD) servers</dt><dd>For each of the top-level domains —
top-level domains such as com, org, net, edu, and gov, and all of the
country top-level domains such as uk, fr, ca, and jp — there is TLD
server (or server cluster). The company Verisign Global Registry
Services maintains the TLD servers for the com top-level domain, and
the company Educause maintains the TLD servers for the edu top-level
domain. TLD servers provide the IP addresses for authoritative DNS
servers.</dd>
<dt>Authoritative DNS servers</dt><dd>Every organization with publicly accessible
hosts (such as Web servers and mail servers) on the Internet must
provide publicly accessible DNS records that map the names of those
hosts to IP addresses. An organization’s authoritative DNS server
houses these DNS records. An organization can choose to implement its
own authoritative DNS server to hold these records; alternatively, the
organization can pay to have these records stored in an authoritative
DNS server of some service provider. Most universities and large
companies implement and maintain their own primary and secondary
(backup) authoritative DNS server.</dd>
</dl>


<p>
The root, TLD, and authoritative DNS servers all belong to the hierarchy of
DNS servers.
</p>

<p>
There is another important type of DNS server called the <code>local DNS
    server</code>. A local DNS server does not strictly belong to the hierarchy of
servers but is nevertheless central to the DNS architecture. Each ISP—such
as a residential ISP or an institutional ISP—has a local DNS server (also
called a default name server). When a host connects to an ISP, the ISP
provides the host with the IP addresses of one or more of its local DNS
servers. When a host makes a DNS query, the query is sent to the local DNS
server, which acts a proxy, forwarding the query into the DNS server
hierarchy
</p>

<p>
Let’s take a look at a simple example. Suppose the host cse.nyu.edu desires
the IP address of gaia.cs.umass.edu . Also suppose that NYU’s ocal DNS
server for cse.nyu.edu is called dns.nyu.edu and that an authoritative DNS
server for gaia.cs.umass.edu is called dns.umass.edu . The host cse.nyu.edu
first sends a DNS query message to its local DNS server, dns.nyu.edu . The
query message contains the hostname to be translated, namely,
gaia.cs.umass.edu . The local DNS server forwards the query message to a
root DNS server. The root DNS server takes note of the edu suffix and
returns to the local DNS server a list of IP addresses for TLD servers
responsible for edu . The local DNS server then resends the query message to
one of these TLD servers. The TLD server takes note of the umass.edu suffix
and responds with the IP address of the authoritative DNS server for the
University of Massachusetts, namely, dns.umass.edu . Finally, the local DNS
server resends the query message directly to dns.umass.edu , which responds
with the IP address of gaia.cs.umass.edu . Note that in this example, in
order to obtain the mapping for one hostname, eight DNS messages were sent:
four query messages and four reply messages!
</p>

<p>
imagen 2.19
</p>

<p>
Our previous example assumed that the TLD server knows the authoritative DNS
server for the hostname. In general this not always true. Instead, the TLD
server may know only of an intermediate DNS server, which in turn knows the
authoritative DNS server for the hostname.
</p>

<pre class="example">
For example, suppose again that the University of Massachusetts has a DNS
server for the university, called dns.umass.edu . Also suppose that each of
the departments at the University of Massachusetts has its own DNS server,
and that each departmental DNS server is authoritative for all hosts in the
department. In this case, when the intermediate DNS server, dns.umass.edu ,
receives a query for a host with a hostname ending with cs.umass.edu , it
returns to dns.nyu.edu the IP address of dns.cs.umass.edu , which is
authoritative for all hostnames ending with cs.umass.edu .  The local DNS
server dns.nyu.edu then sends the query to the authoritative DNS server,
which returns the desired mapping to the local DNS server, which in turn
returns the mapping to the requesting host. In this case, a total of 10 DNS
messages are sent!
</pre>

<p>
The example shown in Figure 2.19 makes use of both <code>recursive queries</code> and
<code>iterative queries</code>. The query sent from cse.nyu.edu to dns.nyu.edu is a
recursive query, since the query asks dns.nyu.edu to obtain the mapping on
its behalf. But the subsequent three queries are iterative since all of the
replies are directly returned to dns.nyu.edu . In theory, any DNS query can
be iterative or recursive.
</p>

<p>
<b>For example, Figure 2.20 shows a DNS query chain for which all of the
queries are recursive</b>. <b>In practice, the queries typically follow the
pattern in Figure 2.19</b>. <b>The query from the requesting host to the local
DNS server is recursive, and the remaining queries are iterative</b>
</p>

<p>
imagen 2.20
</p>
</div>
</div>

<div id="outline-container-org4ba2126" class="outline-4">
<h4 id="org4ba2126"><span class="section-number-4">2.2.2</span> DNS Caching</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
DNS caching improves the delay performance and reduces the number of DNS
messages.
</p>

<p>
La idea es: en una cadena de queries, cuando un server DNS recibe una
respuesta DNS (contenieno, por ejemplo, un mapeo de un hostname a una
direccion IP), este lo puede cachear el mapeo a su memoria local. Si un par
(hostname, IP) esta cacheado en el servidor DNS y otra query llega al
servidor por el mismo hostname, el servidor puede proveer la direccion IP
deseada, incluso si el servidor no es autoritativo para el hostname. Dado
que los mapeos no son permanentes, los servidores DNS descartan la
informacion cacheada luego de un cierto periodo de tiempo.
</p>

<p>
Un servidor DNS local puede cachear tambien las direcciones IP de servidores
TLD, pudiendo saltar sobre el servidor DNS root en la query.
</p>
</div>
</div>
</div>
