org/redes/3.org
** Registros DNS y Mensajes


   Los servidores DNS que en su conjunto implementan la base de datos distribuida
   de DNS, almacenan ~resource records (RRs)~, incluyendo RRs que proveen mapeos
   (hostname, IP). Cada respuesta DNS lleva consigo uno o mas RRs.

   Un resource record es una 4-upla que contiene los campos
   #+BEGIN_SRC
(Name, Value, Type, TTL)
   #+END_SRC

   ~TTL~ es el tiempo de vida del resource record. Determina cuándo un RR
   debería ser removido del cache.

   Los significados de ~Name~ y ~Value~ dependen de ~Type~:

   | Type  | Name           | Value                                 |
   | A     | hostname       | IP address                            |
   | NS    | domain         | hostname de servidor DNS autoritativo |
   | CNAME | hostname alias | hostname canonico                     |
   | MX    | hostname alias | hostname canonico de un mail server   |

   - If Type=A , then Name is a hostname and Value is the IP address for the
     hostname. Thus, a Type A record provides the standard hostname-to-IP
     address mapping. As an example, ~( relay1.bar.foo.com , 145.37.93.126, A)~
     is a Type A record.
   - If Type=NS , then Name is a domain (such as foo.com ) and Value is the
     hostname of an authoritative DNS server that knows how to obtain the IP
     addresses for hosts in the domain. This record is used to route DNS queries
     further along in the query chain. As an example, ~( foo.com , dns.foo.com ,
     NS)~ is a Type NS record.
   - If Type=CNAME , then Value is a canonical hostname for the alias hostname
     Name . This record can provide querying hosts the canonical name for a
     hostname. As an example, ~( foo.com , relay1.bar.foo.com , CNAME)~ is a
     CNAME record.
   - If Type=MX , then Value is the canonical name of a mail server that has an
     alias hostname Name .  As an example, ~( foo.com , mail.bar.foo.com , MX)~
     is an MX record. MX records allow the hostnames of mail servers to have
     simple aliases. Note that by using the MX record, a company can have the
     same aliased name for its mail server and for one of its other servers
     (such as its Web server). To obtain the canonical name for the mail server,
     a DNS client would query for an MX record; to obtain the canonical name for
     the other server, the DNS client would query for the CNAME record.


   Si un servidor DNS es autoritativo para un hostname particular, éste tendrá
   un registro de Tipo A para el hostname. (Incluso si el servidor DNS no es
   autoritativo, puede contener un registro de Tipo A en su cache.)

   Si el servidor no es autoritativo para un hostname, tendrá un registro Tipo
   NS para el dominio que incluye al hostname. También tendrá un registro Tipo A
   que provee la IP del servidor DNS en el campo Value del registro NS.

*** Mensajes DNS
    Existen dos tipos de mensajes DNS, query y response. Ambos tipos tienen el
    mismo formato.

    - Los primeros 12 Bytes son de header section:
      - Número de 16 bits que identifica el tipo de query. Es copiado en el
        mensaje de respuesta de la query, permitiendo que el cliente pueda
        relacionar respuestas recibidas con búsquedas enviadas.
      - Varios flags. Pueden indicar si el mensaje es query o reponse, si la
        respuesta en enviada por un servidor autoritativo, si se desea una query
        recursiva, si el servidor DNS soporta recursion o no.
      - 4 campos que indican la cantidad de ocurrencias de los tipos de
        secciones de datos que le siguen al header.

    - The ~question section~ contains information about the query that is being
      made. This section includes (1) a name field that contains the name that
      is being queried, and (2) a type field that indicates the type of question
      being asked about the name—for example, a host address associated with a
      name (Type A) or the mail server for a name (Type MX).
    - In a reply from a DNS server, the ~answer section~ contains the resource
      records for the name that was originally queried. Recall that in each
      resource record there is the Type (for example, A, NS, CNAME, and MX), the
      Value , and the TTL. A reply can return multiple RRs in the answer, since
      a hostname can have multiple IP addresses (for example, for replicated Web
      servers, as discussed earlier in this section).
    - The ~authority section~ contains records of other authoritative servers.
    - The ~additional section~ contains other helpful records. For example, the
      answer field in a reply to an MX query contains a resource record
      providing the canonical hostname of a mail server. The additional section
      contains a Type A record providing the IP address for the canonical
      hostname of the mail server.

