redes/3.html

<div id="outline-container-org9cda414" class="outline-3">
<h3 id="org9cda414"><span class="section-number-3">2.3</span> Registros DNS y Mensajes</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Los servidores DNS que en su conjunto implementan la base de datos distribuida
de DNS, almacenan <code>resource records (RRs)</code>, incluyendo RRs que proveen mapeos
(hostname, IP). Cada respuesta DNS lleva consigo uno o mas RRs.
</p>

<p>
Un resource record es una 4-upla que contiene los campos
</p>
<pre class="example">
(Name, Value, Type, TTL)
</pre>

<p>
<code>TTL</code> es el tiempo de vida del resource record. Determina cuándo un RR
debería ser removido del cache.
</p>

<p>
Los significados de <code>Name</code> y <code>Value</code> dependen de <code>Type</code>:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Type</td>
<td class="org-left">Name</td>
<td class="org-left">Value</td>
</tr>

<tr>
<td class="org-left">A</td>
<td class="org-left">hostname</td>
<td class="org-left">IP address</td>
</tr>

<tr>
<td class="org-left">NS</td>
<td class="org-left">domain</td>
<td class="org-left">hostname de servidor DNS autoritativo</td>
</tr>

<tr>
<td class="org-left">CNAME</td>
<td class="org-left">hostname alias</td>
<td class="org-left">hostname canonico</td>
</tr>

<tr>
<td class="org-left">MX</td>
<td class="org-left">hostname alias</td>
<td class="org-left">hostname canonico de un mail server</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>If Type=A , then Name is a hostname and Value is the IP address for the
hostname. Thus, a Type A record provides the standard hostname-to-IP
address mapping. As an example, <code>( relay1.bar.foo.com , 145.37.93.126, A)</code>
is a Type A record.</li>
<li>If Type=NS , then Name is a domain (such as foo.com ) and Value is the
hostname of an authoritative DNS server that knows how to obtain the IP
addresses for hosts in the domain. This record is used to route DNS queries
further along in the query chain. As an example, <code>( foo.com , dns.foo.com ,
     NS)</code> is a Type NS record.</li>
<li>If Type=CNAME , then Value is a canonical hostname for the alias hostname
Name . This record can provide querying hosts the canonical name for a
hostname. As an example, <code>( foo.com , relay1.bar.foo.com , CNAME)</code> is a
CNAME record.</li>
<li>If Type=MX , then Value is the canonical name of a mail server that has an
alias hostname Name .  As an example, <code>( foo.com , mail.bar.foo.com , MX)</code>
is an MX record. MX records allow the hostnames of mail servers to have
simple aliases. Note that by using the MX record, a company can have the
same aliased name for its mail server and for one of its other servers
(such as its Web server). To obtain the canonical name for the mail server,
a DNS client would query for an MX record; to obtain the canonical name for
the other server, the DNS client would query for the CNAME record.</li>
</ul>


<p>
Si un servidor DNS es autoritativo para un hostname particular, éste tendrá
un registro de Tipo A para el hostname. (Incluso si el servidor DNS no es
autoritativo, puede contener un registro de Tipo A en su cache.)
</p>

<p>
Si el servidor no es autoritativo para un hostname, tendrá un registro Tipo
NS para el dominio que incluye al hostname. También tendrá un registro Tipo A
que provee la IP del servidor DNS en el campo Value del registro NS.
</p>
</div>

<div id="outline-container-orge21eafb" class="outline-4">
<h4 id="orge21eafb"><span class="section-number-4">2.3.1</span> Mensajes DNS</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Existen dos tipos de mensajes DNS, query y response. Ambos tipos tienen el
mismo formato.
</p>

<ul class="org-ul">
<li>Los primeros 12 Bytes son de header section:
<ul class="org-ul">
<li>Número de 16 bits que identifica el tipo de query. Es copiado en el
mensaje de respuesta de la query, permitiendo que el cliente pueda
relacionar respuestas recibidas con búsquedas enviadas.</li>
<li>Varios flags. Pueden indicar si el mensaje es query o reponse, si la
respuesta en enviada por un servidor autoritativo, si se desea una query
recursiva, si el servidor DNS soporta recursion o no.</li>
<li>4 campos que indican la cantidad de ocurrencias de los tipos de
secciones de datos que le siguen al header.</li>
</ul></li>

<li>The <code>question section</code> contains information about the query that is being
made. This section includes (1) a name field that contains the name that
is being queried, and (2) a type field that indicates the type of question
being asked about the name—for example, a host address associated with a
name (Type A) or the mail server for a name (Type MX).</li>
<li>In a reply from a DNS server, the <code>answer section</code> contains the resource
records for the name that was originally queried. Recall that in each
resource record there is the Type (for example, A, NS, CNAME, and MX), the
Value , and the TTL. A reply can return multiple RRs in the answer, since
a hostname can have multiple IP addresses (for example, for replicated Web
servers, as discussed earlier in this section).</li>
<li>The <code>authority section</code> contains records of other authoritative servers.</li>
<li>The <code>additional section</code> contains other helpful records. For example, the
answer field in a reply to an MX query contains a resource record
providing the canonical hostname of a mail server. The additional section
contains a Type A record providing the IP address for the canonical
hostname of the mail server.</li>
</ul>
</div>
</div>
