org/redes/3.org
*** Inserting Records into the DNS Database

    how records get into the database in the first place?

    Suppose you have just created an exciting new startup company called Network
    Utopia. The first thing you’ll surely want to do is register the domain name
    networkutopia.com at a registrar. A ~registrar~ is a commercial entity that
    verifies the uniqueness of the domain name, enters the domain name into the
    DNS database (as discussed below), and collects a small fee from you for its
    services. Prior to 1999, a single registrar, Network Solutions, had a
    monopoly on domain name registration for com , net , and org domains. But
    now there are many registrars competing for customers, and the Internet
    Corporation for Assigned Names and Numbers (ICANN) accredits the various
    registrars. A complete list of accredited registrars is available at
    http://www.internic.net.

    When you register the domain name networkutopia.com with some registrar, you
    also need to provide the registrar with the names and IP addresses of your
    primary and secondary authoritative DNS servers. Suppose the names and IP
    addresses are dns1.networkutopia.com , dns2.networkutopia.com ,
    ~212.2.212.1~, and ~212.212.212.2~. For each of these two authoritative DNS
    servers, the registrar would then make sure that a Type NS and a Type A
    record are entered into the TLD com servers. Specifically, for the primary
    authoritative server for networkutopia.com , the registrar would insert the
    following two resource records into the DNS system:

    #+BEGIN_SRC
(networkutopia.com, dns1.networkutopia.com, NS)
(dns1.networkutopia.com, 212.212.212.1, A)
    #+END_SRC

    You’ll also have to make sure that the Type A resource record for your Web
    server www.networkutopia.com and the Type MX resource record for your mail
    server mail.networkutopia.com are entered into your authoritative DNS
    servers.

    Once all of these steps are completed, people will be able to visit your Web
    site and send e-mail to the employees at your company.

    #+begin_example
    Suppose Alice in Australia wants to view the Web page www.networkutopia.com.
    As discussed earlier, her host will first send a DNS query to her local
    DNS server. The local DNS server will then contact a TLD com server. (The
    local DNS server will also have to contact a root DNS server if the address
    of a TLD com server is not cached.) This TLD server contains the Type NS and
    Type A resource records listed above, because the registrar had these
    resource records inserted into all of the TLD com servers. The TLD com
    server sends a reply to Alice’s local DNS server, with the reply containing
    the two resource records. The local DNS server then sends a DNS query to
    212.212.212.1 , asking for the Type A record corresponding to
    www.networkutopia.com . This record provides the IP address of the desired
    Web server, say, 212.212.71.4 , which the local DNS server passes back to
    Alice’s host. Alice’s browser can now initiate a TCP connection to the host
    212.212.71.4 and send an HTTP request over the connection.
    #+end_example
